//
//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永无BUG
//
//
//
package com.bbd.adk.event;

/**
 * 通知器
 * @author zhanglinlin@d-bigdata.com
 * @version 1.0.0
 * @see
 *
 */
public interface Notifier {
	
	<L> void register(L listener);
	
	<L> void unregister(L listener);
	
	/**
	 * 事件分发 <br/>
	 * 注意下面三点:
	 * <p>
	 * <li>1.事件不能为null,多个事件时,其中任意一个事件也不能为空.若有有null的情况,框架会忽略此事件分发,并且会打印详细的调用方法</li>
	 * <li>2.如果监听器方法为无参,请分发{@link NoneEvent}事件</li>
	 * <li>3.不支持分发数组,需要使用数组,请改为集合</li>
	 * </p>
	 * @param events
	 * @return
	 */
	boolean dispatcher(Object... events);
	
}
